//XDFNY014 JOB ,'MINAYA'
//COMGO EXEC COB2CG,PARM.COB=(QUOTE)
//COB.SYSIN DD *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTMERG.

      ************************************************

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE-FILE-IN ASSIGN TO INFILE.
           SELECT EMPLOYEE-REPORT ASSIGN TO PRINTER.
           SELECT SORT-FILE ASSIGN TO SYSWORK.

       DATA DIVISION.
       FILE SECTION.
       FD  EMPLOYEE-FILE-IN
           RECORDING MODE IS F
           RECORD CONTAINS 80 CHARACTERS.

       01  EMPLOYEE-RECORD-IN         PIC X(80).

       SD  SORT-FILE.

       01  SORT-RECORD.
           05  COMPANY-NAME-S          PIC X(15).
           05  ADDRESS-S               PIC X(15).
           05  CITY-STATE-S            PIC X(15).
           05  EMP-NAME-S              PIC X(20).
           05  EMP-TITLE-S             PIC X(15).

       FD  EMPLOYEE-REPORT
           RECORDING MODE IS F.
       01  REPORT-LINE              PIC X(120).

       WORKING-STORAGE SECTION.
       01  EOF                      PIC X(1)   VALUE "N".
       01  FIRST-LINE              PIC X(1) VALUE "Y".
       01  COMPANY-NAME-SAVE        PIC X(15).
       01  EMPLOYEE-W               PIC 9.

       01  PAGE-HEAD-1.
           05               PIC X(35) VALUE SPACES.
           05               PIC X(14)
                          VALUE "COMPANY ROSTER".

       01  PAGE-HEAD-2.
           05                      PIC X(5) VALUE "DATE ".
           05  RUN-MONTH-AND-DAY   PIC Z9/99/.
           05  RUN-YEAR            PIC 99.
           05                      PIC X(60) VALUE SPACES.
           05                      PIC X(5) VALUE "PAGE ".
           05  PAGE-NUMBER-OUT     PIC Z9.

       01  PAGE-HEAD-3.
           05                 PIC X(55) VALUE SPACES.
           05                 PIC X(8) VALUE "EMPLOYEE".

       01  PAGE-HEAD-4.
           05                 PIC X(12) VALUE "COMPANY NAME".
           05                 PIC X(6) VALUE SPACES.
           05                 PIC X(14) VALUE "STREET ADDRESS".
           05                 PIC X(3) VALUE SPACES.
           05                 PIC X(14) VALUE "CITY AND STATE".
           05                 PIC X(7) VALUE SPACES.
           05                 PIC X(5) VALUE "TITLE".
           05                 PIC X(10) VALUE SPACES.
           05                 PIC X(13) VALUE "EMPLOYEE NAME".

       01  LINE-MARKER-1.
           05                 PIC X(87) VALUE ALL "-".

       01  DETAIL-LINE.
           05  COMPANY-NAME-OUT    PIC X(15).
           05  FILLER              PIC X(3) VALUE SPACES.
           05  ADDRESS-OUT         PIC X(15).
           05  FILLER              PIC X(4) VALUE SPACES.
           05  CITY-STATE-OUT      PIC X(15).
           05  FILLER              PIC X(2) VALUE SPACES.
           05  EMP-TITLE-OUT       PIC X(15).
           05  FILLER              PIC X(2) VALUE SPACES.
           05  EMP-NAME-OUT        PIC X(20).

       01  COMPANY-BREAK-LINE.
           05                      PIC X(11) VALUE SPACES.
           05                      PIC X(29) VALUE
                     "TOTAL NUMBER OF EMPLOYEES = ".
           05  EMP-COUNT-CMP        PIC X(1).
           05                      PIC X(5) VALUE " FOR ".
           05  COMPANY-NAME-CMP    PIC X(15).

       01  PAGE-NUMBER-W           PIC 99 VALUE ZERO.
       01  LINE-SPACING    VALUE 1 PIC 9 COMP SYNC.
       01  TODAYS-DATE.
           05  RUN-YEAR            PIC 99.
           05  RUN-MONTH-AND-DAY   PIC 9(4).
      ***************************************************
       PROCEDURE DIVISION.
       100-CTRL-RTN.
           SORT SORT-FILE
                ON ASCENDING KEY COMPANY-NAME-S
                ON ASCENDING KEY EMP-NAME-S
                   USING EMPLOYEE-FILE-IN
                   OUTPUT PROCEDURE 200-PROCESS-RECORD
           STOP RUN.

       200-PROCESS-RECORD.
           OPEN OUTPUT EMPLOYEE-REPORT
           ACCEPT TODAYS-DATE FROM DATE
           MOVE CORRESPONDING TODAYS-DATE TO PAGE-HEAD-2
           PERFORM PRINT-PAGE-HEADINGS
           PERFORM UNTIL EOF = "Y"
              RETURN SORT-FILE
                 AT END
                    MOVE "Y" TO EOF
                 NOT AT END
                    PERFORM 300-PROCESS-RTN
              END-RETURN
           MOVE COMPANY-NAME-S TO COMPANY-NAME-SAVE
           END-PERFORM
           PERFORM COMPANY-CONTROL-BREAK
           CLOSE EMPLOYEE-REPORT.

       PRINT-PAGE-HEADINGS.
           ADD 1 TO PAGE-NUMBER-W
           MOVE PAGE-NUMBER-W TO PAGE-NUMBER-OUT
           WRITE REPORT-LINE FROM PAGE-HEAD-1 AFTER PAGE
           WRITE REPORT-LINE FROM PAGE-HEAD-2
           WRITE REPORT-LINE FROM PAGE-HEAD-3
           WRITE REPORT-LINE FROM PAGE-HEAD-4
           WRITE REPORT-LINE FROM LINE-MARKER-1
           MOVE 2 TO LINE-SPACING
           MOVE COMPANY-NAME-S  TO COMPANY-NAME-SAVE.

       300-PROCESS-RTN.
           EVALUATE TRUE
              WHEN COMPANY-NAME-S NOT = COMPANY-NAME-SAVE
                 PERFORM COMPANY-CONTROL-BREAK
                 PERFORM PRODUCE-DETAIL-LINE
              WHEN COMPANY-NAME-S = COMPANY-NAME-SAVE
                 PERFORM PRODUCE-DETAIL-LINE
           END-EVALUATE.

       COMPANY-CONTROL-BREAK.
           MOVE SPACES TO REPORT-LINE
           WRITE REPORT-LINE
           MOVE COMPANY-NAME-SAVE TO COMPANY-NAME-CMP
           MOVE EMPLOYEE-W TO EMP-COUNT-CMP
           MOVE "Y" TO FIRST-LINE
           WRITE REPORT-LINE FROM COMPANY-BREAK-LINE
           MOVE SPACES TO REPORT-LINE
           WRITE REPORT-LINE
           MOVE 0 TO EMPLOYEE-W
           MOVE COMPANY-NAME-S TO COMPANY-NAME-SAVE.

       PRODUCE-DETAIL-LINE.
           ADD 1 TO EMPLOYEE-W
           IF FIRST-LINE = "Y"
              MOVE COMPANY-NAME-S TO COMPANY-NAME-OUT
              MOVE ADDRESS-S TO ADDRESS-OUT
              MOVE CITY-STATE-S TO CITY-STATE-OUT
              MOVE EMP-TITLE-S TO EMP-TITLE-OUT
              MOVE EMP-NAME-S TO EMP-NAME-OUT
              MOVE "N" TO FIRST-LINE
              WRITE REPORT-LINE FROM DETAIL-LINE AFTER LINE-SPACING
           ELSE
              MOVE SPACES TO COMPANY-NAME-OUT
              MOVE SPACES TO ADDRESS-OUT
              MOVE SPACES TO CITY-STATE-OUT
              MOVE EMP-TITLE-S TO EMP-TITLE-OUT
              MOVE EMP-NAME-S TO EMP-NAME-OUT
              WRITE REPORT-LINE FROM DETAIL-LINE AFTER LINE-SPACING
           END-IF.
/*
//GO.INFILE DD DSN=WYL.NY.XDF.JOBLIST,DISP=SHR
//GO.PRINTER DD SYSOUT=A
//
